app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id =10)  ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.all.where("user_id =?", User.find_by_username(current_user.username))

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "lolp"]]
---
  def profile
    if (User.find_by_username(params[:id]))