app/controllers/posts_controller.rb

     def create
          @post = Post.new(post_params)
          @post.user_id = current_user.id
          respond_to do |f|
          if (@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "test"], ["user_id", 10], ["created_at", "2017-04-08 01:05:47.903443"], ["updated_at", "2017-04-08 01:05:47.903443"]]