app/views/layouts/_nav_user.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "HahaJKJK"]]
---
    <img src="https://raw.githubusercontent.com/corear/CommitMatch/master/app/assets/images/CMiconWhite.png" style="position:fixed; height:40px; width:40px; left:10px; top:10px;" >
    <a class="temp1" href="/user/<%= current_user.username %>" style="text-decoration:none; color:#fff; font-size: 20px; padding:10px; margin:10px; position:fixed; border-radius:10px;left:50px;"><%= current_user.firstName %> <%= current_user.lastName[0..0] %>. | <b>@<%= current_user.username %></b></a>